<a href="https://colab.research.google.com/github/rahuldevkar5/Data_Science/blob/main/Support_Vector_Machine_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
get_ipython().run_line_magic('matplotlib', 'inline')

In [3]:
salary_train=pd.read_csv('/content/SalaryData_Train(1).csv')
salary_train.head()

   age          workclass   education  ...  hoursperweek          native  Salary
0   39          State-gov   Bachelors  ...            40   United-States   <=50K
1   50   Self-emp-not-inc   Bachelors  ...            13   United-States   <=50K
2   38            Private     HS-grad  ...            40   United-States   <=50K
3   53            Private        11th  ...            40   United-States   <=50K
4   28            Private   Bachelors  ...            40            Cuba   <=50K

[5 rows x 14 columns]

In [4]:
salary_train.columns

Index(['age', 'workclass', 'education', 'educationno', 'maritalstatus',
       'occupation', 'relationship', 'race', 'sex', 'capitalgain',
       'capitalloss', 'hoursperweek', 'native', 'Salary'],
      dtype='object')

In [5]:
columns=['age', 'workclass', 'education', 'educationno', 'maritalstatus','occupation', 'relationship', 'race', 'sex', 'capitalgain',
         'capitalloss', 'hoursperweek', 'native', 'Salary']

In [6]:
Salary_train=salary_train.drop(columns=['educationno','occupation', 'relationship', 'race','native','workclass','education','maritalstatus','sex'])
Salary_train

       age  capitalgain  capitalloss  hoursperweek  Salary
0       39         2174            0            40   <=50K
1       50            0            0            13   <=50K
2       38            0            0            40   <=50K
3       53            0            0            40   <=50K
4       28            0            0            40   <=50K
...    ...          ...          ...           ...     ...
30156   27            0            0            38   <=50K
30157   40            0            0            40    >50K
30158   58            0            0            40   <=50K
30159   22            0            0            20   <=50K
30160   52        15024            0            40    >50K

[30161 rows x 5 columns]

In [7]:
X=Salary_train.iloc[:,:4]
y=Salary_train.iloc[:,4]

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.33, random_state=42)

In [8]:
from sklearn import svm

clf = svm.SVC(kernel='rbf')
clf.fit(X_train, y_train)

SVC(C=1.0, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [9]:
salary_test=pd.read_csv('/content/SalaryData_Test(1).csv')
salary_test.head()

   age   workclass      education  ...  hoursperweek          native  Salary
0   25     Private           11th  ...            40   United-States   <=50K
1   38     Private        HS-grad  ...            50   United-States   <=50K
2   28   Local-gov     Assoc-acdm  ...            40   United-States    >50K
3   44     Private   Some-college  ...            40   United-States    >50K
4   34     Private           10th  ...            30   United-States   <=50K

[5 rows x 14 columns]

In [10]:
salary_test=salary_train.drop(columns=['educationno','occupation', 'relationship', 'race','native','workclass','education','maritalstatus','sex'])
salary_test

       age  capitalgain  capitalloss  hoursperweek  Salary
0       39         2174            0            40   <=50K
1       50            0            0            13   <=50K
2       38            0            0            40   <=50K
3       53            0            0            40   <=50K
4       28            0            0            40   <=50K
...    ...          ...          ...           ...     ...
30156   27            0            0            38   <=50K
30157   40            0            0            40    >50K
30158   58            0            0            40   <=50K
30159   22            0            0            20   <=50K
30160   52        15024            0            40    >50K

[30161 rows x 5 columns]

In [11]:
X=salary_test.iloc[:,:4]
y=salary_test.iloc[:,4]

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.33, random_state=42)

In [12]:
from sklearn.metrics import accuracy_score

y_pred=clf.predict(X_test)
accuracy_score(y_test,y_pred)

0.7955595740405867